<template>
  <section class="prices wrapper">
    <h1 class="prices__title">
      {{ title }}
    </h1>
    <div v-for="block in prices" :key="block.id" class="prices__blocks">
      <h2 class="prices__blocks-title">
        {{ block.title }}
      </h2>
      <div v-for="item in block.list" :key="item.id" class="prices__block">
        <div class="prices__block-container">
          <h3 class="prices__block-title">
            {{ item.title }}
          </h3>
          <span class="prices__block-price">
            {{ item.price }}
          </span>
        </div>
        <hr />
        <p class="prices__block-description">
          {{ item.des }}
        </p>
      </div>
      <UIApplicationBtn class="prices__btn"> Оставить заявку </UIApplicationBtn>
    </div>
  </section>
</template>

<script>
export default {
  data() {
    return {
      title: "Наши цены",
      prices: [
        {
          id: 1,
          title: "Разработка сайтов",
          list: [
            {
              id: 1,
              title: "ПРОМО-САЙТ",
              des: `Веб-ресурс, создаваемый для раскрутки на рынке бренда, товара, услуги
          или события`,
              price: "от ₽8 000",
            },
            {
              id: 2,
              title: "LANDING PAGE",
              des: `Целевая страница, основной задачей которой является сбор контактных
          данных целевой аудиторииот`,
              price: "₽5 000",
            },
            {
              id: 3,
              title: "САЙТ-ВИЗИТКА",
              des: `Небольшой сайт, состоящий из 3-4 страниц. Отлично подходит малому
          бизнесу или стартапам`,
              price: "от ₽15 000",
            },
            {
              id: 4,
              title: "КОРПОРАТИВНЫЙ САЙТ",
              des: `Лицо компании в сети Интернет, содержащий в себе подробную информацию
          о компании, сфере деятельности, предложения для клиентов`,
              price: "от ₽30 000",
            },
            {
              id: 5,
              title: "ИНТЕРНЕТ МАГАЗИН",
              des: `Сайт позволяющий пользователям онлайн, через браузер или мобильное
          приложение, сформировать заказ на покупку товара`,
              price: "от ₽50 000",
            },
            {
              id: 6,
              title: "ВЕБ-СЕРВИС",
              des: `Любое программное обеспечение, которое доступно через Интернет и
          использует стандартизированную систему обмена сообщениями`,
              price: "от ₽50 000",
            },
          ],
        },
        {
          id: 2,
          title: "Аудит и редизайн сайтов",
          list: [
            {
              id: 1,
              title: "ВИЗУАЛЬНЫЙ РЕДИЗАЙН",
              des: "Изменение внешнего вида страниц сайта. Работа с контентом",
              price: "от ₽5 000",
            },
            {
              id: 2,
              title: "ФУНКЦИОНАЛЬНЫЙ РЕДИЗАЙН",
              des: `Добавление новых функций, которые улучшают юзабилити сайта. Работа с
          контентом`,
              price: "от ₽15 000",
            },
            {
              id: 3,
              title: "ТЕХНИЧЕСКИЙ РЕДИЗАЙН",
              des: `Повышение скорости загрузки страниц сайта, работа над ошибками в коде.
          Работа с контентом`,
              price: "от ₽15 000",
            },
            {
              id: 4,
              title: "ПОЛНЫЙ РЕДИЗАЙН",
              des: `Переработка визуала сайта, добавление новых функций, улучшение
          юзабилити, повышение скорости загрузки страниц. Работа с контентом`,
              price: "от ₽30 000",
            },
          ],
        },
        {
          id: 3,
          title: "Брендинг и ребрендинг",
          list: [
            {
              id: 1,
              title: "ЛОГОТИП",
              des: `Эмблема или символика, которую используют организации и частные лица
          для идентификации своей деятельности и повышения узнаваемости`,
              price: "от ₽5 000",
            },
            {
              id: 2,
              title: "БРЕНДБУК",
              des: `Официальный документ компании, в котором описывается концепция бренда,
          атрибуты бренда, целевая аудитория, позиционирование компании`,
              price: "от ₽30 000",
            },
            {
              id: 3,
              title: "УПАКОВКА",
              des: `Совокупность формы, материалов, цветовой гаммы, изображений и других
          вспомогательных элементов`,
              price: "от ₽30 000",
            },
            {
              id: 4,
              title: "ФИРМЕННЫЙ СТИЛЬ",
              des: `Комбинация визуальных элементов, которые размещают на товарах,
          упаковках, рекламных материалах компании и используют при коммуникации
          с клиентами`,
              price: "от ₽50 000",
            },
          ],
        },
        {
          id: 4,
          title: "Продвижение и реклама",
          list: [
            {
              id: 1,
              title: "SEO ОПТИМИЗАЦИЯ",
              des: "Комплексное продвижение сайта по поисковым системам Яндекс и Google",
              price: "от ₽15 000",
            },
            {
              id: 2,
              title: "УПРАВЛЯЮЩИЙ БИЗНЕС-АККАУНТОМ INSTAGRAM",
              des: "Профессиональное ведение и оформление инстаграм аккаунта",
              price: "от ₽5 000",
            },
            {
              id: 3,
              title: "ТАРГЕТИРОВАННАЯ РЕКЛАМА",
              des: "Совокупность формы, материалов, цветовой гаммы, изображений и других вспомогательных элементов",
              price: "от ₽15 000",
            },
          ],
        },
      ],
    };
  },
};
</script>

<style lang="scss">
.prices__btn {
  margin-top: 80px;
}
@media screen and (max-width: 960px) {
  .prices__block-price {
    font-size: 14px;
  }
  .prices__title {
    font-size: 28px;
  }
  .prices__blocks {
    padding-bottom: 40px;
  }
  .prices__blocks-title {
    font-size: 18px;
    padding-bottom: 15px;
  }
  .prices__block-title {
    font-size: 14px;
  }
  .prices__block-description {
    font-size: 12px;
  }
  .prices__btn {
    margin-top: 15px;
  }
  .prices {
    padding-bottom: 30px;
  }
}
</style>
